Revit 2024 API
ParameterTypeId.FabricationPartAngleOption Property
 "Angle Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationPartAngleOption { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartAngleOption As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationPartAngleOption {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace